run/tests/PolymKWLF+hPolym+Tait+Cross+RadiativeConvective/PruebaMalla2D/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT	// limit the temperature in a physical range to increase stability and convergence
{
    type           limitTemperature;
    active	    yes;
    
    limitTemperatureCoeffs
    {
	selectionMode	all;
	min		290;	// Tmin [K]
	max		600;	// Tmax [K]
    }
}



// ************************************************************************* //
